Запрос 6. Негативный сценарий (индекс не помогает)

--Сценарий А: LIKE с % в начале
-- ========================================
-- 1. БЕЗ ИНДЕКСА
-- ========================================
EXPLAIN ANALYZE 
SELECT * FROM BOOKING 
WHERE CAST(booking_id AS TEXT) LIKE '%5%';  --CAST(... AS TEXT) — преобразует число в текст (строку)
-- LIKE '%5%' - ищем ID, содержащие цифру 5
-- '%5%' — значит: "в строке есть цифра 5 где угодно"

-- ========================================
-- 2. СОЗДАЁМ ИНДЕКС (который не поможет)
-- ========================================
CREATE INDEX idx_booking_id_text ON BOOKING (CAST(booking_id AS TEXT));

-- ========================================
-- 3. С ИНДЕКСОМ (результат будет таким же или хуже)
-- ========================================
EXPLAIN ANALYZE 
SELECT * FROM BOOKING 
WHERE CAST(booking_id AS TEXT) LIKE '%5%';

-- ========================================
-- 4. УДАЛЯЕМ ИНДЕКС
-- ========================================
DROP INDEX idx_booking_id_text;



--Сценарий Б: функция на колонке (индекс не работает)
-- ========================================
-- 1. БЕЗ ИНДЕКСА
-- ========================================
EXPLAIN ANALYZE 
SELECT * FROM BOOKING 
WHERE EXTRACT(MONTH FROM ДАТА_БРОНИРОВАНИЯ) = 5;--тока май
-- EXTRACT(MONTH ...) - функция, которая достаёт из даты месяц
-- Индекс на ДАТА_БРОНИРОВАНИЯ не поможет, потому что колонка обёрнута в функцию

-- ========================================
-- 2. СОЗДАЁМ ОБЫЧНЫЙ ИНДЕКС (не поможет)
-- ========================================
CREATE INDEX idx_booking_date ON BOOKING (ДАТА_БРОНИРОВАНИЯ);

-- ========================================
-- 3. С ИНДЕКСОМ (всё равно Seq Scan)
-- ========================================
EXPLAIN ANALYZE 
SELECT * FROM BOOKING 
WHERE EXTRACT(MONTH FROM ДАТА_БРОНИРОВАНИЯ) = 5;

-- ========================================
-- 4. УДАЛЯЕМ ИНДЕКС
-- ========================================
DROP INDEX idx_booking_date;


вывод А: % в начале означает "искать везде" — индекс бесполезен.
вывод Б: Колонка обёрнута в функцию EXTRACT — индекс не сработал.


Почему индекс не работает	Пример
% в начале -	LIKE '%текст%'
Функция на колонке -	WHERE EXTRACT(MONTH FROM date) = 5
Неявное преобразование типов -	WHERE phone = 123 (phone — текст)

-- 3. Создаём GIN индекс для полнотекстового поиска
CREATE INDEX idx_booking_text ON BOOKING USING GIN (to_tsvector('russian', CAST(booking_id AS TEXT)));

-- 3. Создаём GiST индекс для поиска по интервалам
CREATE INDEX idx_booking_month ON BOOKING USING GiST (DATE_TRUNC('month', ДАТА_БРОНИРОВАНИЯ)::DATE);